Revit 2024 API
Railing.TopRail Property
 The top rail of the railing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ElementId TopRail { get; }
Visual Basic
Public ReadOnly Property TopRail As ElementId
	Get
Visual C++
public:
property ElementId^ TopRail {
	ElementId^ get ();
}
See Also
Railing Class
Autodesk.Revit.DB.Architecture Namespace